RIOT-OS/RIOT/drivers/cc3200sdk/inc/hw_mcasp.h
#define MCASP_AHCLKRCTL_HCLKRADJ_S 16
#define MCASP_AHCLKRCTL_HCLKRM  0x00008000  // High Freq. RCV clock Source 0 1
#define MCASP_AHCLKRCTL_HCLKRP  0x00004000  // High Freq. clock Polarity Before
// diviser 0 1
#define MCASP_AHCLKRCTL_HCLKRDIV_M \
                                0x00000FFF  // RCV clock Divide Ratio

#define MCASP_AHCLKRCTL_HCLKRDIV_S 0
//******************************************************************************
//
// The following are defines for the bit fields in the MCASP_O_RXTDM register.
//
//******************************************************************************
#define MCASP_RXTDM_RTDMS31     0x80000000  // RCV mode during TDM time slot 31
// 0 1
#define MCASP_RXTDM_RTDMS30     0x40000000  // RCV mode during TDM time slot 30
// 0 1
#define MCASP_RXTDM_RTDMS29     0x20000000  // RCV mode during TDM time slot 29
// 0 1
#define MCASP_RXTDM_RTDMS28     0x10000000  // RCV mode during TDM time slot 28
// 0 1
#define MCASP_RXTDM_RTDMS27     0x08000000  // RCV mode during TDM time slot 27
// 0 1
#define MCASP_RXTDM_RTDMS26     0x04000000  // RCV mode during TDM time slot 26
// 0 1
#define MCASP_RXTDM_RTDMS25     0x02000000  // RCV mode during TDM time slot 25
// 0 1
#define MCASP_RXTDM_RTDMS24     0x01000000  // RCV mode during TDM time slot 24
// 0 1
#define MCASP_RXTDM_RTDMS23     0x00800000  // RCV mode during TDM time slot 23
// 0 1
#define MCASP_RXTDM_RTDMS22     0x00400000  // RCV mode during TDM time slot 22
// 0 1
#define MCASP_RXTDM_RTDMS21     0x00200000  // RCV mode during TDM time slot 21
// 0 1
#define MCASP_RXTDM_RTDMS20     0x00100000  // RCV mode during TDM time slot 20
// 0 1
#define MCASP_RXTDM_RTDMS19     0x00080000  // RCV mode during TDM time slot 19
// 0 1
#define MCASP_RXTDM_RTDMS18     0x00040000  // RCV mode during TDM time slot 18
// 0 1
#define MCASP_RXTDM_RTDMS17     0x00020000  // RCV mode during TDM time slot 17
// 0 1
#define MCASP_RXTDM_RTDMS16     0x00010000  // RCV mode during TDM time slot 16
// 0 1
#define MCASP_RXTDM_RTDMS15     0x00008000  // RCV mode during TDM time slot 15
// 0 1
#define MCASP_RXTDM_RTDMS14     0x00004000  // RCV mode during TDM time slot 14
// 0 1
#define MCASP_RXTDM_RTDMS13     0x00002000  // RCV mode during TDM time slot 13
// 0 1
#define MCASP_RXTDM_RTDMS12     0x00001000  // RCV mode during TDM time slot 12
// 0 1
#define MCASP_RXTDM_RTDMS11     0x00000800  // RCV mode during TDM time slot 11
// 0 1
#define MCASP_RXTDM_RTDMS10     0x00000400  // RCV mode during TDM time slot 10
// 0 1
#define MCASP_RXTDM_RTDMS9      0x00000200  // RCV mode during TDM time slot 9
// 0 1
#define MCASP_RXTDM_RTDMS8      0x00000100  // RCV mode during TDM time slot 8
// 0 1
#define MCASP_RXTDM_RTDMS7      0x00000080  // RCV mode during TDM time slot 7
// 0 1
#define MCASP_RXTDM_RTDMS6      0x00000040  // RCV mode during TDM time slot 6
// 0 1
#define MCASP_RXTDM_RTDMS5      0x00000020  // RCV mode during TDM time slot 5
// 0 1
#define MCASP_RXTDM_RTDMS4      0x00000010  // RCV mode during TDM time slot 4
// 0 1
#define MCASP_RXTDM_RTDMS3      0x00000008  // RCV mode during TDM time slot 3
// 0 1
#define MCASP_RXTDM_RTDMS2      0x00000004  // RCV mode during TDM time slot 2
// 0 1
#define MCASP_RXTDM_RTDMS1      0x00000002  // RCV mode during TDM time slot 1
// 0 1
#define MCASP_RXTDM_RTDMS0      0x00000001  // RCV mode during TDM time slot 0
// 0 1
//******************************************************************************
//
// The following are defines for the bit fields in the MCASP_O_EVTCTLR register.
//
//******************************************************************************
#define MCASP_EVTCTLR_RSTAFRM   0x00000080  // RCV Start of Frame Interrupt 0 1
#define MCASP_EVTCTLR_RDATA     0x00000020  // RCV Data Interrupt 0 1
#define MCASP_EVTCTLR_RLAST     0x00000010  // RCV Last Slot Interrupt 0 1
#define MCASP_EVTCTLR_RDMAERR   0x00000008  // RCV DMA Bus Error 0 1
#define MCASP_EVTCTLR_RCKFAIL   0x00000004  // Bad Clock Interrupt 0 1
#define MCASP_EVTCTLR_RSYNCERR  0x00000002  // RCV Unexpected FSR Interrupt 0 1
#define MCASP_EVTCTLR_ROVRN     0x00000001  // RCV Underrun Flag 0 1
//******************************************************************************
//
// The following are defines for the bit fields in the MCASP_O_RXSTAT register.
//
//******************************************************************************
#define MCASP_RXSTAT_RERR       0x00000100  // RCV Error 0 1
#define MCASP_RXSTAT_RDMAERR    0x00000080  // RCV DMA bus error 0 1
#define MCASP_RXSTAT_RSTAFRM    0x00000040  // Start of Frame-RCV 0 1
#define MCASP_RXSTAT_RDATA      0x00000020  // Data Ready Flag 0 1
#define MCASP_RXSTAT_RLAST      0x00000010  // Last Slot Interrupt Flag 0 1
#define MCASP_RXSTAT_RTDMSLOT   0x00000008  // EvenOdd Slot 0 1
#define MCASP_RXSTAT_RCKFAIL    0x00000004  // Bad Transmit Flag 0 1
#define MCASP_RXSTAT_RSYNCERR   0x00000002  // Unexpected RCV Frame sync flag 0
// 1
#define MCASP_RXSTAT_ROVRN      0x00000001  // RCV Underrun Flag 0 1
//******************************************************************************
//
// The following are defines for the bit fields in the MCASP_O_RXTDMSLOT register.
//
//******************************************************************************
#define MCASP_RXTDMSLOT_RSLOTCNT_M \
                                0x000003FF  // Current RCV time slot count

#define MCASP_RXTDMSLOT_RSLOTCNT_S 0
//******************************************************************************
//
// The following are defines for the bit fields in the MCASP_O_RXCLKCHK register.
//
//******************************************************************************
#define MCASP_RXCLKCHK_RCNT_M   0xFF000000  // RCV clock count value
#define MCASP_RXCLKCHK_RCNT_S   24
#define MCASP_RXCLKCHK_RMAX_M   0x00FF0000  // RCV clock maximum boundary
#define MCASP_RXCLKCHK_RMAX_S   16
#define MCASP_RXCLKCHK_RMIN_M   0x0000FF00  // RCV clock minimum boundary
#define MCASP_RXCLKCHK_RMIN_S   8
#define MCASP_RXCLKCHK_RPS_M    0x0000000F  // RCV clock check prescaler 0x0
// 0x1 0x2 0x3 0x4 0x5 0x6 0x7 0x8
#define MCASP_RXCLKCHK_RPS_S    0
//******************************************************************************
//
// The following are defines for the bit fields in the MCASP_O_REVTCTL register.
//
//******************************************************************************
#define MCASP_REVTCTL_RDATDMA   0x00000001  // RCV data DMA request 0 Enable
// DMA Transfer 1 Disable DMA
// Transfer
//******************************************************************************
//
// The following are defines for the bit fields in the MCASP_O_GBLCTLX register.
//
//******************************************************************************
#define MCASP_GBLCTLX_XFRST     0x00001000  // Frame sync generator reset 0 1
#define MCASP_GBLCTLX_XSMRST    0x00000800  // XMT state machine reset 0 1
#define MCASP_GBLCTLX_XSRCLR    0x00000400  // XMT serializer clear 0 1
#define MCASP_GBLCTLX_XHCLKRST  0x00000200  // XMT High Freq. clk Divider 0 1
#define MCASP_GBLCTLX_XCLKRST   0x00000100  // XMT clock divder reset 0 1
#define MCASP_GBLCTLX_RFRST     0x00000010
#define MCASP_GBLCTLX_RSMRST    0x00000008
#define MCASP_GBLCTLX_RSRCLKR   0x00000004
#define MCASP_GBLCTLX_RHCLKRST  0x00000002
#define MCASP_GBLCTLX_RCLKRST   0x00000001
//******************************************************************************
//
// The following are defines for the bit fields in the MCASP_O_TXMASK register.
//
//******************************************************************************
#define MCASP_TXMASK_XMASK31    0x80000000  // XMASK BIT 31 0 1
#define MCASP_TXMASK_XMASK30    0x40000000  // XMASK BIT 30 0 1
#define MCASP_TXMASK_XMASK29    0x20000000  // XMASK BIT 29 0 1
#define MCASP_TXMASK_XMASK28    0x10000000  // XMASK BIT 28 0 1
#define MCASP_TXMASK_XMASK27    0x08000000  // XMASK BIT 27 0 1
#define MCASP_TXMASK_XMASK26    0x04000000  // XMASK BIT 26 0 1
#define MCASP_TXMASK_XMASK25    0x02000000  // XMASK BIT 25 0 1
#define MCASP_TXMASK_XMASK24    0x01000000  // XMASK BIT 24 0 1
#define MCASP_TXMASK_XMASK23    0x00800000  // XMASK BIT 23 0 1
#define MCASP_TXMASK_XMASK22    0x00400000  // XMASK BIT 22 0 1
#define MCASP_TXMASK_XMASK21    0x00200000  // XMASK BIT 21 0 1
#define MCASP_TXMASK_XMASK20    0x00100000  // XMASK BIT 20 0 1
#define MCASP_TXMASK_XMASK19    0x00080000  // XMASK BIT 19 0 1
#define MCASP_TXMASK_XMASK18    0x00040000  // XMASK BIT 18 0 1
#define MCASP_TXMASK_XMASK17    0x00020000  // XMASK BIT 17 0 1
#define MCASP_TXMASK_XMASK16    0x00010000  // XMASK BIT 16 0 1
#define MCASP_TXMASK_XMASK15    0x00008000  // XMASK BIT 15 0 1
#define MCASP_TXMASK_XMASK14    0x00004000  // XMASK BIT 14 0 1
#define MCASP_TXMASK_XMASK13    0x00002000  // XMASK BIT 13 0 1
#define MCASP_TXMASK_XMASK12    0x00001000  // XMASK BIT 12 0 1
#define MCASP_TXMASK_XMASK11    0x00000800  // XMASK BIT 11 0 1
#define MCASP_TXMASK_XMASK10    0x00000400  // XMASK BIT 10 0 1
#define MCASP_TXMASK_XMASK9     0x00000200  // XMASK BIT 9 0 1
#define MCASP_TXMASK_XMASK8     0x00000100  // XMASK BIT 8 0 1
#define MCASP_TXMASK_XMASK7     0x00000080  // XMASK BIT 7 0 1
#define MCASP_TXMASK_XMASK6     0x00000040  // XMASK BIT 6 0 1
#define MCASP_TXMASK_XMASK5     0x00000020  // XMASK BIT 5 0 1
#define MCASP_TXMASK_XMASK4     0x00000010  // XMASK BIT 4 0 1
#define MCASP_TXMASK_XMASK3     0x00000008  // XMASK BIT 3 0 1
#define MCASP_TXMASK_XMASK2     0x00000004  // XMASK BIT 2 0 1
#define MCASP_TXMASK_XMASK1     0x00000002  // XMASK BIT 1 0 1
#define MCASP_TXMASK_XMASK0     0x00000001  // XMASK BIT 0 0 1
//******************************************************************************
//
// The following are defines for the bit fields in the MCASP_O_TXFMT register.
//
//******************************************************************************
#define MCASP_TXFMT_XDATDLY_M   0x00030000  // XMT Frame sync delay 0x0 0 Bit
// delay 0x1 1 Bit delay 0x2 2 Bit
// delay
#define MCASP_TXFMT_XDATDLY_S   16
#define MCASP_TXFMT_XRVRS       0x00008000  // XMT serial stream bit order 0 1
#define MCASP_TXFMT_XPAD_M      0x00006000  // Pad value 0x0 0x1 0x2
#define MCASP_TXFMT_XPAD_S      13
#define MCASP_TXFMT_XPBIT_M     0x00001F00  // Pad bit position
#define MCASP_TXFMT_XPBIT_S     8
#define MCASP_TXFMT_XSSZ_M      0x000000F0  // XMT slot Size 0x0 0x1 0x2 0x3
// 0x4 0x5 0x6 0x7 0x8 0x9 0xA 0xB
// 0xC 0xD 0xE 0xF
#define MCASP_TXFMT_XSSZ_S      4
#define MCASP_TXFMT_XBUSEL      0x00000008  // Write to XBUF using CPU/DMA 0
// DMA port access 1 CPU port Access
#define MCASP_TXFMT_XROT_M      0x00000007  // Right Rotate Value 0x0 0x1 0x2
// 0x3 0x4 0x5 0x6 0x7
#define MCASP_TXFMT_XROT_S      0
//******************************************************************************
//
// The following are defines for the bit fields in the MCASP_O_TXFMCTL register.
//
//******************************************************************************
#define MCASP_TXFMCTL_XMOD_M    0x0000FF80  // XMT Frame sync mode
#define MCASP_TXFMCTL_XMOD_S    7
#define MCASP_TXFMCTL_FXWID     0x00000010  // XMT Frame sync Duration 0 1
#define MCASP_TXFMCTL_FSXM      0x00000002  // XMT frame sync External 0 1
#define MCASP_TXFMCTL_FSXP      0x00000001  // XMT Frame sync Polarity 0 1
//******************************************************************************
//
// The following are defines for the bit fields in the MCASP_O_ACLKXCTL register.
//
//******************************************************************************
#define MCASP_ACLKXCTL_BUSY     0x00100000
#define MCASP_ACLKXCTL_DIVBUSY  0x00080000
#define MCASP_ACLKXCTL_ADJBUSY  0x00040000
#define MCASP_ACLKXCTL_CLKXADJ_M \
                                0x00030000

#define MCASP_ACLKXCTL_CLKXADJ_S 16
#define MCASP_ACLKXCTL_CLKXP    0x00000080  // XMT Clock Polarity 0 1
#define MCASP_ACLKXCTL_ASYNC    0x00000040  // XMT/RCV operation sync /Async 0
// 1
#define MCASP_ACLKXCTL_CLKXM    0x00000020  // XMT clock source 0 1
#define MCASP_ACLKXCTL_CLKXDIV_M \
                                0x0000001F  // XMT clock devide ratio

#define MCASP_ACLKXCTL_CLKXDIV_S 0
//******************************************************************************
//
// The following are defines for the bit fields in the MCASP_O_AHCLKXCTL register.
//
//******************************************************************************
#define MCASP_AHCLKXCTL_BUSY    0x00100000
#define MCASP_AHCLKXCTL_DIVBUSY 0x00080000
#define MCASP_AHCLKXCTL_ADJBUSY 0x00040000
#define MCASP_AHCLKXCTL_HCLKXADJ_M \
                                0x00030000

#define MCASP_AHCLKXCTL_HCLKXADJ_S 16
#define MCASP_AHCLKXCTL_HCLKXM  0x00008000  // High Freq. XMT clock Source 0 1
#define MCASP_AHCLKXCTL_HCLKXP  0x00004000  // High Freq. clock Polarity Before
// diviser 0 1
#define MCASP_AHCLKXCTL_HCLKXDIV_M \
                                0x00000FFF  // XMT clock Divide Ratio

