RIOT-OS/RIOT/drivers/cc3200sdk/inc/hw_mcasp.h
#define MCASP_DITUDRB3_DITUDRB3_S 0
//******************************************************************************
//
// The following are defines for the bit fields in the MCASP_O_DITUDRB4 register.
//
//******************************************************************************
#define MCASP_DITUDRB4_DITUDRB4_M \
                                0xFFFFFFFF  // Right (odd TDM slot ) User Data

#define MCASP_DITUDRB4_DITUDRB4_S 0
//******************************************************************************
//
// The following are defines for the bit fields in the MCASP_O_DITUDRB5 register.
//
//******************************************************************************
#define MCASP_DITUDRB5_DITUDRB5_M \
                                0xFFFFFFFF  // Right (odd TDM slot ) User Data

#define MCASP_DITUDRB5_DITUDRB5_S 0
//******************************************************************************
//
// The following are defines for the bit fields in the MCASP_O_XRSRCTL0 register.
//
//******************************************************************************
#define MCASP_XRSRCTL0_RRDY     0x00000020
#define MCASP_XRSRCTL0_XRDY     0x00000010
#define MCASP_XRSRCTL0_DISMOD_M 0x0000000C  // Serializer drive state 0x0 Tri
// state 0x1 Reserved 0x2 Drive pin
// low 0x3 Drive pin high
#define MCASP_XRSRCTL0_DISMOD_S 2
#define MCASP_XRSRCTL0_SRMOD_M  0x00000003  // Serializer Mode 0x0 InActive
// mode 0x1 Transmit mode 0x2
// Receive mode
#define MCASP_XRSRCTL0_SRMOD_S  0
//******************************************************************************
//
// The following are defines for the bit fields in the MCASP_O_XRSRCTL1 register.
//
//******************************************************************************
#define MCASP_XRSRCTL1_RRDY     0x00000020
#define MCASP_XRSRCTL1_XRDY     0x00000010
#define MCASP_XRSRCTL1_DISMOD_M 0x0000000C  // Serializer drive state 0x0 Tri
// state 0x1 Reserved 0x2 Drive pin
// low 0x3 Drive pin high
#define MCASP_XRSRCTL1_DISMOD_S 2
#define MCASP_XRSRCTL1_SRMOD_M  0x00000003  // Serializer Mode 0x0 InActive
// mode 0x1 Transmit mode 0x2
// Receive mode
#define MCASP_XRSRCTL1_SRMOD_S  0
//******************************************************************************
//
// The following are defines for the bit fields in the MCASP_O_XRSRCTL2 register.
//
//******************************************************************************
#define MCASP_XRSRCTL2_RRDY     0x00000020
#define MCASP_XRSRCTL2_XRDY     0x00000010
#define MCASP_XRSRCTL2_DISMOD_M 0x0000000C  // Serializer drive state 0x0 Tri
// state 0x1 Reserved 0x2 Drive pin
// low 0x3 Drive pin high
#define MCASP_XRSRCTL2_DISMOD_S 2
#define MCASP_XRSRCTL2_SRMOD_M  0x00000003  // Serializer Mode 0x0 InActive
// mode 0x1 Transmit mode 0x2
// Receive mode
#define MCASP_XRSRCTL2_SRMOD_S  0
//******************************************************************************
//
// The following are defines for the bit fields in the MCASP_O_XRSRCTL3 register.
//
//******************************************************************************
#define MCASP_XRSRCTL3_RRDY     0x00000020
#define MCASP_XRSRCTL3_XRDY     0x00000010
#define MCASP_XRSRCTL3_DISMOD_M 0x0000000C  // Serializer drive state 0x0 Tri
// state 0x1 Reserved 0x2 Drive pin
// low 0x3 Drive pin high
#define MCASP_XRSRCTL3_DISMOD_S 2
#define MCASP_XRSRCTL3_SRMOD_M  0x00000003  // Serializer Mode 0x0 InActive
// mode 0x1 Transmit mode 0x2
// Receive mode
#define MCASP_XRSRCTL3_SRMOD_S  0
//******************************************************************************
//
// The following are defines for the bit fields in the MCASP_O_XRSRCTL4 register.
//
//******************************************************************************
#define MCASP_XRSRCTL4_RRDY     0x00000020
#define MCASP_XRSRCTL4_XRDY     0x00000010
#define MCASP_XRSRCTL4_DISMOD_M 0x0000000C  // Serializer drive state 0x0 Tri
// state 0x1 Reserved 0x2 Drive pin
// low 0x3 Drive pin high
#define MCASP_XRSRCTL4_DISMOD_S 2
#define MCASP_XRSRCTL4_SRMOD_M  0x00000003  // Serializer Mode 0x0 InActive
// mode 0x1 Transmit mode 0x2
// Receive mode
#define MCASP_XRSRCTL4_SRMOD_S  0
//******************************************************************************
//
// The following are defines for the bit fields in the MCASP_O_XRSRCTL5 register.
//
//******************************************************************************
#define MCASP_XRSRCTL5_RRDY     0x00000020
#define MCASP_XRSRCTL5_XRDY     0x00000010
#define MCASP_XRSRCTL5_DISMOD_M 0x0000000C  // Serializer drive state 0x0 Tri
// state 0x1 Reserved 0x2 Drive pin
// low 0x3 Drive pin high
#define MCASP_XRSRCTL5_DISMOD_S 2
#define MCASP_XRSRCTL5_SRMOD_M  0x00000003  // Serializer Mode 0x0 InActive
// mode 0x1 Transmit mode 0x2
// Receive mode
#define MCASP_XRSRCTL5_SRMOD_S  0
//******************************************************************************
//
// The following are defines for the bit fields in the MCASP_O_XRSRCTL6 register.
//
//******************************************************************************
#define MCASP_XRSRCTL6_RRDY     0x00000020
#define MCASP_XRSRCTL6_XRDY     0x00000010
#define MCASP_XRSRCTL6_DISMOD_M 0x0000000C  // Serializer drive state 0x0 Tri
// state 0x1 Reserved 0x2 Drive pin
// low 0x3 Drive pin high
#define MCASP_XRSRCTL6_DISMOD_S 2
#define MCASP_XRSRCTL6_SRMOD_M  0x00000003  // Serializer Mode 0x0 InActive
// mode 0x1 Transmit mode 0x2
// Receive mode
#define MCASP_XRSRCTL6_SRMOD_S  0
//******************************************************************************
//
// The following are defines for the bit fields in the MCASP_O_XRSRCTL7 register.
//
//******************************************************************************
#define MCASP_XRSRCTL7_RRDY     0x00000020
#define MCASP_XRSRCTL7_XRDY     0x00000010
#define MCASP_XRSRCTL7_DISMOD_M 0x0000000C  // Serializer drive state 0x0 Tri
// state 0x1 Reserved 0x2 Drive pin
// low 0x3 Drive pin high
#define MCASP_XRSRCTL7_DISMOD_S 2
#define MCASP_XRSRCTL7_SRMOD_M  0x00000003  // Serializer Mode 0x0 InActive
// mode 0x1 Transmit mode 0x2
// Receive mode
#define MCASP_XRSRCTL7_SRMOD_S  0
//******************************************************************************
//
// The following are defines for the bit fields in the MCASP_O_XRSRCTL8 register.
//
//******************************************************************************
#define MCASP_XRSRCTL8_RRDY     0x00000020
#define MCASP_XRSRCTL8_XRDY     0x00000010
#define MCASP_XRSRCTL8_DISMOD_M 0x0000000C  // Serializer drive state 0x0 Tri
// state 0x1 Reserved 0x2 Drive pin
// low 0x3 Drive pin high
#define MCASP_XRSRCTL8_DISMOD_S 2
#define MCASP_XRSRCTL8_SRMOD_M  0x00000003  // Serializer Mode 0x0 InActive
// mode 0x1 Transmit mode 0x2
// Receive mode
#define MCASP_XRSRCTL8_SRMOD_S  0
//******************************************************************************
//
// The following are defines for the bit fields in the MCASP_O_XRSRCTL9 register.
//
//******************************************************************************
#define MCASP_XRSRCTL9_RRDY     0x00000020
#define MCASP_XRSRCTL9_XRDY     0x00000010
#define MCASP_XRSRCTL9_DISMOD_M 0x0000000C  // Serializer drive state 0x0 Tri
// state 0x1 Reserved 0x2 Drive pin
// low 0x3 Drive pin high
#define MCASP_XRSRCTL9_DISMOD_S 2
#define MCASP_XRSRCTL9_SRMOD_M  0x00000003  // Serializer Mode 0x0 InActive
// mode 0x1 Transmit mode 0x2
// Receive mode
#define MCASP_XRSRCTL9_SRMOD_S  0
//******************************************************************************
//
// The following are defines for the bit fields in the MCASP_O_XRSRCTL10 register.
//
//******************************************************************************
#define MCASP_XRSRCTL10_RRDY    0x00000020
#define MCASP_XRSRCTL10_XRDY    0x00000010
#define MCASP_XRSRCTL10_DISMOD_M \
                                0x0000000C  // Serializer drive state 0x0 Tri
// state 0x1 Reserved 0x2 Drive pin
// low 0x3 Drive pin high

#define MCASP_XRSRCTL10_DISMOD_S 2
#define MCASP_XRSRCTL10_SRMOD_M 0x00000003  // Serializer Mode 0x0 InActive
// mode 0x1 Transmit mode 0x2
// Receive mode
#define MCASP_XRSRCTL10_SRMOD_S 0
//******************************************************************************
//
// The following are defines for the bit fields in the MCASP_O_XRSRCTL11 register.
//
//******************************************************************************
#define MCASP_XRSRCTL11_RRDY    0x00000020
#define MCASP_XRSRCTL11_XRDY    0x00000010
#define MCASP_XRSRCTL11_DISMOD_M \
                                0x0000000C  // Serializer drive state 0x0 Tri
// state 0x1 Reserved 0x2 Drive pin
// low 0x3 Drive pin high

#define MCASP_XRSRCTL11_DISMOD_S 2
#define MCASP_XRSRCTL11_SRMOD_M 0x00000003  // Serializer Mode 0x0 InActive
// mode 0x1 Transmit mode 0x2
// Receive mode
#define MCASP_XRSRCTL11_SRMOD_S 0
//******************************************************************************
//
// The following are defines for the bit fields in the MCASP_O_XRSRCTL12 register.
//
//******************************************************************************
#define MCASP_XRSRCTL12_RRDY    0x00000020
#define MCASP_XRSRCTL12_XRDY    0x00000010
#define MCASP_XRSRCTL12_DISMOD_M \
                                0x0000000C  // Serializer drive state 0x0 Tri
// state 0x1 Reserved 0x2 Drive pin
// low 0x3 Drive pin high

#define MCASP_XRSRCTL12_DISMOD_S 2
#define MCASP_XRSRCTL12_SRMOD_M 0x00000003  // Serializer Mode 0x0 InActive
// mode 0x1 Transmit mode 0x2
// Receive mode
#define MCASP_XRSRCTL12_SRMOD_S 0
//******************************************************************************
//
// The following are defines for the bit fields in the MCASP_O_XRSRCTL13 register.
//
//******************************************************************************
#define MCASP_XRSRCTL13_RRDY    0x00000020
#define MCASP_XRSRCTL13_XRDY    0x00000010
#define MCASP_XRSRCTL13_DISMOD_M \
                                0x0000000C  // Serializer drive state 0x0 Tri
// state 0x1 Reserved 0x2 Drive pin
// low 0x3 Drive pin high

#define MCASP_XRSRCTL13_DISMOD_S 2
#define MCASP_XRSRCTL13_SRMOD_M 0x00000003  // Serializer Mode 0x0 InActive
// mode 0x1 Transmit mode 0x2
// Receive mode
#define MCASP_XRSRCTL13_SRMOD_S 0
//******************************************************************************
//
// The following are defines for the bit fields in the MCASP_O_XRSRCTL14 register.
//
//******************************************************************************
#define MCASP_XRSRCTL14_RRDY    0x00000020
#define MCASP_XRSRCTL14_XRDY    0x00000010
#define MCASP_XRSRCTL14_DISMOD_M \
                                0x0000000C  // Serializer drive state 0x0 Tri
// state 0x1 Reserved 0x2 Drive pin
// low 0x3 Drive pin high

#define MCASP_XRSRCTL14_DISMOD_S 2
#define MCASP_XRSRCTL14_SRMOD_M 0x00000003  // Serializer Mode 0x0 InActive
// mode 0x1 Transmit mode 0x2
// Receive mode
#define MCASP_XRSRCTL14_SRMOD_S 0
//******************************************************************************
//
// The following are defines for the bit fields in the MCASP_O_XRSRCTL15 register.
//
//******************************************************************************
#define MCASP_XRSRCTL15_RRDY    0x00000020
#define MCASP_XRSRCTL15_XRDY    0x00000010
#define MCASP_XRSRCTL15_DISMOD_M \
                                0x0000000C  // Serializer drive state 0x0 Tri
// state 0x1 Reserved 0x2 Drive pin
// low 0x3 Drive pin high

#define MCASP_XRSRCTL15_DISMOD_S 2
#define MCASP_XRSRCTL15_SRMOD_M 0x00000003  // Serializer Mode 0x0 InActive
// mode 0x1 Transmit mode 0x2
// Receive mode
#define MCASP_XRSRCTL15_SRMOD_S 0
//******************************************************************************
//
// The following are defines for the bit fields in the MCASP_O_TXBUF0 register.
//
//******************************************************************************
#define MCASP_TXBUF0_XBUF0_M    0xFFFFFFFF  // Transmit Buffer 0
#define MCASP_TXBUF0_XBUF0_S    0
//******************************************************************************
//
// The following are defines for the bit fields in the MCASP_O_TXBUF1 register.
//
//******************************************************************************
#define MCASP_TXBUF1_XBUF1_M    0xFFFFFFFF  // Transmit Buffer 1
#define MCASP_TXBUF1_XBUF1_S    0
//******************************************************************************
//
// The following are defines for the bit fields in the MCASP_O_TXBUF2 register.
//
//******************************************************************************
#define MCASP_TXBUF2_XBUF2_M    0xFFFFFFFF  // Transmit Buffer 2
#define MCASP_TXBUF2_XBUF2_S    0
//******************************************************************************
//
// The following are defines for the bit fields in the MCASP_O_TXBUF3 register.
//
//******************************************************************************
#define MCASP_TXBUF3_XBUF3_M    0xFFFFFFFF  // Transmit Buffer 3
#define MCASP_TXBUF3_XBUF3_S    0
//******************************************************************************
//
// The following are defines for the bit fields in the MCASP_O_TXBUF4 register.
//
//******************************************************************************
#define MCASP_TXBUF4_XBUF4_M    0xFFFFFFFF  // Transmit Buffer 4
#define MCASP_TXBUF4_XBUF4_S    0
//******************************************************************************
//
// The following are defines for the bit fields in the MCASP_O_TXBUF5 register.
//
//******************************************************************************
#define MCASP_TXBUF5_XBUF5_M    0xFFFFFFFF  // Transmit Buffer 5
#define MCASP_TXBUF5_XBUF5_S    0
//******************************************************************************
//
// The following are defines for the bit fields in the MCASP_O_TXBUF6 register.
//
//******************************************************************************
#define MCASP_TXBUF6_XBUF6_M    0xFFFFFFFF  // Transmit Buffer 6
#define MCASP_TXBUF6_XBUF6_S    0
//******************************************************************************
//
// The following are defines for the bit fields in the MCASP_O_TXBUF7 register.
//
//******************************************************************************
#define MCASP_TXBUF7_XBUF7_M    0xFFFFFFFF  // Transmit Buffer 7
#define MCASP_TXBUF7_XBUF7_S    0
//******************************************************************************
//
// The following are defines for the bit fields in the MCASP_O_TXBUF8 register.
//
//******************************************************************************
#define MCASP_TXBUF8_XBUF8_M    0xFFFFFFFF  // Transmit Buffer 8
#define MCASP_TXBUF8_XBUF8_S    0
//******************************************************************************
//
// The following are defines for the bit fields in the MCASP_O_TXBUF9 register.
//
//******************************************************************************
#define MCASP_TXBUF9_XBUF9_M    0xFFFFFFFF  // Transmit Buffer 9
#define MCASP_TXBUF9_XBUF9_S    0
//******************************************************************************
//
// The following are defines for the bit fields in the MCASP_O_TXBUF10 register.
//
//******************************************************************************
#define MCASP_TXBUF10_XBUF10_M  0xFFFFFFFF  // Transmit Buffer 10
#define MCASP_TXBUF10_XBUF10_S  0
//******************************************************************************
//
// The following are defines for the bit fields in the MCASP_O_TXBUF11 register.
//
//******************************************************************************
#define MCASP_TXBUF11_XBUF11_M  0xFFFFFFFF  // Transmit Buffer 11
#define MCASP_TXBUF11_XBUF11_S  0
//******************************************************************************
//
// The following are defines for the bit fields in the MCASP_O_TXBUF12 register.
//
//******************************************************************************
#define MCASP_TXBUF12_XBUF12_M  0xFFFFFFFF  // Transmit Buffer 12
#define MCASP_TXBUF12_XBUF12_S  0
//******************************************************************************
//
// The following are defines for the bit fields in the MCASP_O_TXBUF13 register.
//
//******************************************************************************
#define MCASP_TXBUF13_XBUF13_M  0xFFFFFFFF  // Transmit Buffer 13
#define MCASP_TXBUF13_XBUF13_S  0
//******************************************************************************
//
// The following are defines for the bit fields in the MCASP_O_TXBUF14 register.
//
//******************************************************************************
#define MCASP_TXBUF14_XBUF14_M  0xFFFFFFFF  // Transmit Buffer 14
#define MCASP_TXBUF14_XBUF14_S  0
//******************************************************************************
//
// The following are defines for the bit fields in the MCASP_O_TXBUF15 register.
//
//******************************************************************************
#define MCASP_TXBUF15_XBUF15_M  0xFFFFFFFF  // Transmit Buffer 15
#define MCASP_TXBUF15_XBUF15_S  0
//******************************************************************************
//
// The following are defines for the bit fields in the MCASP_O_RXBUF0 register.
//
//******************************************************************************
#define MCASP_RXBUF0_RBUF0_M    0xFFFFFFFF  // Receive Buffer 0
#define MCASP_RXBUF0_RBUF0_S    0
//******************************************************************************
//
// The following are defines for the bit fields in the MCASP_O_RXBUF1 register.
//
//******************************************************************************
#define MCASP_RXBUF1_RBUF1_M    0xFFFFFFFF  // Receive Buffer 1
#define MCASP_RXBUF1_RBUF1_S    0
//******************************************************************************
//
// The following are defines for the bit fields in the MCASP_O_RXBUF2 register.
//
//******************************************************************************
#define MCASP_RXBUF2_RBUF2_M    0xFFFFFFFF  // Receive Buffer 2
#define MCASP_RXBUF2_RBUF2_S    0
//******************************************************************************
//
// The following are defines for the bit fields in the MCASP_O_RXBUF3 register.
//
//******************************************************************************
#define MCASP_RXBUF3_RBUF3_M    0xFFFFFFFF  // Receive Buffer 3
#define MCASP_RXBUF3_RBUF3_S    0
//******************************************************************************
//
// The following are defines for the bit fields in the MCASP_O_RXBUF4 register.
//
//******************************************************************************
#define MCASP_RXBUF4_RBUF4_M    0xFFFFFFFF  // Receive Buffer 4
#define MCASP_RXBUF4_RBUF4_S    0
//******************************************************************************
//
// The following are defines for the bit fields in the MCASP_O_RXBUF5 register.
//
//******************************************************************************
#define MCASP_RXBUF5_RBUF5_M    0xFFFFFFFF  // Receive Buffer 5
#define MCASP_RXBUF5_RBUF5_S    0
//******************************************************************************
//
// The following are defines for the bit fields in the MCASP_O_RXBUF6 register.
//
//******************************************************************************
#define MCASP_RXBUF6_RBUF6_M    0xFFFFFFFF  // Receive Buffer 6
#define MCASP_RXBUF6_RBUF6_S    0
//******************************************************************************
//
// The following are defines for the bit fields in the MCASP_O_RXBUF7 register.
//
//******************************************************************************
#define MCASP_RXBUF7_RBUF7_M    0xFFFFFFFF  // Receive Buffer 7
#define MCASP_RXBUF7_RBUF7_S    0
//******************************************************************************
//
// The following are defines for the bit fields in the MCASP_O_RXBUF8 register.
//
//******************************************************************************
#define MCASP_RXBUF8_RBUF8_M    0xFFFFFFFF  // Receive Buffer 8
#define MCASP_RXBUF8_RBUF8_S    0
//******************************************************************************
//
// The following are defines for the bit fields in the MCASP_O_RXBUF9 register.
//
//******************************************************************************
#define MCASP_RXBUF9_RBUF9_M    0xFFFFFFFF  // Receive Buffer 9
#define MCASP_RXBUF9_RBUF9_S    0
//******************************************************************************
//
// The following are defines for the bit fields in the MCASP_O_RXBUF10 register.
//
//******************************************************************************
#define MCASP_RXBUF10_RBUF10_M  0xFFFFFFFF  // Receive Buffer 10
#define MCASP_RXBUF10_RBUF10_S  0
//******************************************************************************
//
// The following are defines for the bit fields in the MCASP_O_RXBUF11 register.
//
//******************************************************************************
#define MCASP_RXBUF11_RBUF11_M  0xFFFFFFFF  // Receive Buffer 11
#define MCASP_RXBUF11_RBUF11_S  0
//******************************************************************************
//
// The following are defines for the bit fields in the MCASP_O_RXBUF12 register.
//
//******************************************************************************
#define MCASP_RXBUF12_RBUF12_M  0xFFFFFFFF  // Receive Buffer 12
#define MCASP_RXBUF12_RBUF12_S  0
//******************************************************************************
//
// The following are defines for the bit fields in the MCASP_O_RXBUF13 register.
//
//******************************************************************************
#define MCASP_RXBUF13_RBUF13_M  0xFFFFFFFF  // Receive Buffer 13
#define MCASP_RXBUF13_RBUF13_S  0
//******************************************************************************
//
// The following are defines for the bit fields in the MCASP_O_RXBUF14 register.
//
//******************************************************************************
#define MCASP_RXBUF14_RBUF14_M  0xFFFFFFFF  // Receive Buffer 14
#define MCASP_RXBUF14_RBUF14_S  0
//******************************************************************************
//
// The following are defines for the bit fields in the MCASP_O_RXBUF15 register.
//
//******************************************************************************
#define MCASP_RXBUF15_RBUF15_M  0xFFFFFFFF  // Receive Buffer 15
#define MCASP_RXBUF15_RBUF15_S  0

#endif // __HW_MCASP_H__
